export const dataSteps = [
  {
    id: "step-1",
    title: "Знайти",
    text: "найзручніше для вас розташування",
  },
  {
    id: "step-2",
    title: "Забронювати",
    text: "будь - яку суму та валюту",
  },
  {
    id: "step-3",
    title: "Оплатити",
    text: "безпосередньо в обмінному відділенні",
  },
];
export const dataStepsMetal = [
  {
    id: "step-1",
    title: "Бо з нами надійно-наші обмінники облаштовані системами відеостостереження",
    text: "",
  },
  {
    id: "step-2",
    title: "Ви отримаєте гарне обслуговування і найкращу оцінку",
    text: "",
  },
  {
    id: "step-3",
    title: "Швидкість-ви отримаєте відразу ж грошові кошти",
    text: "",
  },
  {
    id: "step-4",
    title: "Ми працюємо без вихідних,графік роботи максимально гнучкий",
    text: "",
  },
];


export const dataServices = [
  {
    id: "step-1",
    icon: "/money-calculator.svg",
    title: "Вигідний курс",
    text: "Ми завжди стежимо за актуальним ринковим курсом валют, у нас ви можете обміняти за найвигіднішим курсом.",
  },
  {
    id: "step-2",
    icon: "/money-safe.svg",
    title: "Завжди в наявності",
    text: "Завжди в наявності є гривня та валюта, якщо у Вас велика сума на замовлення ми обов'язково вам надамо її.",
  },
  {
    id: "step-3",
    icon: "/sale-tag.svg",
    title: "Прийом зношених",
    url: "/pryiom-poshkodzhenykh-kupyur",
    text: "Ми пропонуємо нашим клієнтам найнижчу комісію за купівлю старої валюти, оскільки ми працюємо напряму без посередників",
  },
  {
    id: "step-4",
    icon: "/refresh-dollar.svg",
    title: "Конвертація",
    text: "Прямий курс обміну $ на € та інші іноземні валюти без гривні та без додаткових комісій",
  },
  {
    id: "step-5",
    icon: "/cash-move.svg",
    title: "Інкасація",
    text: "У вас є необхідність здійснити угоду в банку або в нотаріуса, чи іншому місці, ми доставим валюту за адресою з найнижчою комісією",
  },
  {
    id: "step-6",
    icon: "/money-exchange.svg",
    title: "Заміна на нові",
    text: "Ви можете обміняти ваші старі купюри на нові, за найкращими умовами.",
  },
];
