"use client";
import styles from "./index.module.css";
import { useCallback } from "react";


export default function ShareButton({ title, text, url }: {
  title: string;
  text: string;
  url: string;
}) {

  const handleShare = useCallback(async () => {
    const shareData = {
      title,
      text,
      url,
    };

    try {
      if (navigator.share) {
        await navigator.share(shareData);
      } else {
        // fallback: copy URL to clipboard
        await navigator.clipboard.writeText(url);
        alert("Посилання скопійовано!");
      }
    } catch (error) {
      console.log("Share canceled", error);
    }
  }, [title, text, url]);

  return (
    <button
      onClick={handleShare}
      className={styles.handleShare}
    >
      Поділитися курсом <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M18.1016 23.028L11.2883 19.312C10.6343 19.9612 9.80269 20.4022 8.89839 20.5795C7.99409 20.7568 7.05755 20.6623 6.20683 20.3081C5.35612 19.9539 4.62932 19.3557 4.11807 18.5891C3.60681 17.8224 3.33398 16.9215 3.33398 16C3.33398 15.0785 3.60681 14.1776 4.11807 13.4109C4.62932 12.6442 5.35612 12.0461 6.20683 11.6919C7.05755 11.3376 7.99409 11.2432 8.89839 11.4205C9.80269 11.5978 10.6343 12.0388 11.2883 12.688L18.1016 8.97198C17.8679 7.87563 18.0367 6.7318 18.5771 5.74966C19.1174 4.76751 19.9933 4.01269 21.0444 3.62323C22.0955 3.23377 23.2518 3.23568 24.3016 3.62863C25.3515 4.02158 26.2248 4.7793 26.7619 5.76323C27.299 6.74717 27.464 7.89155 27.2266 8.98712C26.9893 10.0827 26.3656 11.0562 25.4695 11.7297C24.5734 12.4032 23.4648 12.7316 22.3464 12.6549C21.2281 12.5782 20.1747 12.1015 19.3789 11.312L12.5656 15.028C12.7019 15.6684 12.7019 16.3303 12.5656 16.9707L19.3789 20.688C20.1747 19.8985 21.2281 19.4218 22.3464 19.3451C23.4648 19.2684 24.5734 19.5968 25.4695 20.2703C26.3656 20.9437 26.9893 21.9173 27.2266 23.0128C27.464 24.1084 27.299 25.2528 26.7619 26.2367C26.2248 27.2207 25.3515 27.9784 24.3016 28.3713C23.2518 28.7643 22.0955 28.7662 21.0444 28.3767C19.9933 27.9873 19.1174 27.2325 18.5771 26.2503C18.0367 25.2682 17.8679 24.1243 18.1016 23.028Z" fill="#FFCC00"/>
</svg>
    </button>
  );
}
